//Date homework:
///*Да се предефинират оператори -- префикс и -- постфикс за класа Date.
//  Да се предефинират оператори << и >> за класа Date. Формата на датата
//да е: dd-mm-yyyy*/

//Box homework:
///*Да се реализира клас Box (кутия) с 3 полета за ширина,
//дължина и височина, конструктор и сет/гет методи.
//Да се предефинират оператори които биха позволили следния запис да работи:
//box3 = box1 + box2;
//където box1, box2, box3 са обекти от Box. Box3 се получава когато сложим
//двете кутии една над друга.*/