//Здравейте,
//
//Изпращам условието на задача за създаване на система за футболна федерация.
//Условието е орязано от една по-голяма задача, така че може да има липсващи релации.
//Съветът ми е първо добре да помислите за класовете и. къде и как ще има наследяване, композиция ; както и в какви структури от данни ще се пази информацията (вектори, списъци) и какви методи за работа с тези данни ще има (добавяне, изтриване, промяна)
//
//Система за футболна федерация :
//3 типа потребители
//
//Администрация– автентикира се с потребителско име и парола
//        Рефер– автентикира се с потребителско име и парола
//        Фенове
//
//Администрация:
//- Добавя, променя и отписва отбори. Информацията за отбора  е: име, адрес, град, треньор, играчи, изиграни срещи, победи, задгуби, равенства, точки и класиране (за година), снимка
//- Създава и променя графика за годината. Графика съдържа информация за срещите:
//- Кръг от първенството, дата, час, стадион, град, отбор гост, отбор домакин, рефер
//- Създава/Променя класирането
//
//Рефер :
//- Води отчет за всяка среща  -  резултат, картони, автори на попаденията, време на попаденията
//
//        Фенове:
//- Вижда графика
//- Купува билет за избрана от него среща, като за целта се регистрира.
//- Вижда класирането
//
//Системата да показва и статистическа информация – класиране, загуби на всеки отбор, победи на всеки отбор, брой зрители за отборите по срещи, картони и други. Статистиката се вижда от всички потребители.
//
//
//Поздрави,
//Катя